<script>
export default {
  data() {
    return {
      // тут переменные которые будут изменяться или использоваться для отображения или для изменения состояния(видно или не видно блок например)
    }
  },
  components: {
    //тут импортируются компоненты (например карточка)
  },
  computed: {
    // тут функции которые что-то считают и возвращают что-то (пока можно не использовать, это для оптимизации)
  },
  methods: {
    //тут функции которые будем использовать для изменения визуального контента (изменение переменных, добавление стилей, и т. д.) в целом можно все тут писать
  },

  created() {},

  mounted() {
    // то что происходит когда страница создаётся (то есть запуск анимаций которые должны проиграться при открытии страницы и подобное)
  },

  unmounted() {
    // то что происходит когда страница закрывается/происходит переход на другу страницу
  },
}
</script>

<template>
    <div class="card">
        <div class="card-imgBlock">
            <img class="card-imgBlock-img" src="../assets/imgs/cat1.jpg" alt="">
            <img class="card-imgBlock-like" src="../assets/imgs/Heart.svg" alt="">
            <div class="card-imgBlock-name">
                <h3>КотоБубсик</h3>
            </div>
        </div>
        <div class="card-info">
            <p>Информация о КотоБубсике</p>
        </div>
    </div>
</template>

<style src="./card.css"></style>
